In [48]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [49]:
%%sql
create database if not exists joinpractice;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [50]:
%%sql
use joinpractice;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [51]:
%%sql
create table if not exists customer (customer_id int primary key ,customer_name varchar(30) not null,customer_address varchar(255) not null);
desc customer;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.

[('customer_id', 'int', 'NO', 'PRI', None, ''),
 ('customer_name', 'varchar(30)', 'NO', '', None, ''),
 ('customer_address', 'varchar(255)', 'NO', 'MUL', None, '')]

In [52]:
%%sql
create table if not exists orders(order_id int primary key,total_price decimal(10,2) not null, customer_id int,
foreign key (customer_id) references customer(customer_id));
desc orders;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.

[('order_id', 'int', 'NO', 'PRI', None, ''),
 ('total_price', 'decimal(10,2)', 'NO', '', None, ''),
 ('customer_id', 'int', 'YES', 'MUL', None, '')]

In [53]:
%%sql

insert into customer values(1,'Tharun','sirukalanji'),(2,'Shanmugam','Uthukuli'),(3,'Vikas','Perundurai'),(4,'Thenmozhi','Erode');
select * from customer;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'customer.PRIMARY'
[SQL: insert into customer values(1,'Tharun','sirukalanji'),(2,'Shanmugam','Uthukuli'),(3,'Vikas','Perundurai'),(4,'Thenmozhi','Erode');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [54]:
%%sql

insert into orders values(1,100.0,1),(2,125.50,1),(3,456.75,4);
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'orders.PRIMARY'
[SQL: insert into orders values(1,100.0,1),(2,125.50,1),(3,456.75,4);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [41]:
# %%sql

# select * from customer join orders ;

 * mysql+mysqlconnector://root:***@localhost/
12 rows affected.

[(1, 'Tharun', 'sirukalanji', 3, Decimal('456.75'), 4),
 (1, 'Tharun', 'sirukalanji', 2, Decimal('125.50'), 1),
 (1, 'Tharun', 'sirukalanji', 1, Decimal('100.00'), 1),
 (2, 'Shanmugam', 'Uthukuli', 3, Decimal('456.75'), 4),
 (2, 'Shanmugam', 'Uthukuli', 2, Decimal('125.50'), 1),
 (2, 'Shanmugam', 'Uthukuli', 1, Decimal('100.00'), 1),
 (3, 'Vikas', 'Perundurai', 3, Decimal('456.75'), 4),
 (3, 'Vikas', 'Perundurai', 2, Decimal('125.50'), 1),
 (3, 'Vikas', 'Perundurai', 1, Decimal('100.00'), 1),
 (4, 'Thenmozhi', 'Erode', 3, Decimal('456.75'), 4),
 (4, 'Thenmozhi', 'Erode', 2, Decimal('125.50'), 1),
 (4, 'Thenmozhi', 'Erode', 1, Decimal('100.00'), 1)]

In [42]:
# %%sql

# select * from customer join orders on customer.customer_id=orders.customer_id ;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Tharun', 'sirukalanji', 1, Decimal('100.00'), 1),
 (1, 'Tharun', 'sirukalanji', 2, Decimal('125.50'), 1),
 (4, 'Thenmozhi', 'Erode', 3, Decimal('456.75'), 4)]

In [43]:
# %%sql

# SELECT * 
# FROM customer 
# LEFT JOIN orders 
# ON customer.customer_id = orders.customer_id;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Tharun', 'sirukalanji', 2, Decimal('125.50'), 1),
 (1, 'Tharun', 'sirukalanji', 1, Decimal('100.00'), 1),
 (2, 'Shanmugam', 'Uthukuli', None, None, None),
 (3, 'Vikas', 'Perundurai', None, None, None),
 (4, 'Thenmozhi', 'Erode', 3, Decimal('456.75'), 4)]

In [44]:
# %%sql
# SELECT * 
# FROM customer 
# right JOIN orders 
# ON customer.customer_id = orders.customer_id;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Tharun', 'sirukalanji', 1, Decimal('100.00'), 1),
 (1, 'Tharun', 'sirukalanji', 2, Decimal('125.50'), 1),
 (4, 'Thenmozhi', 'Erode', 3, Decimal('456.75'), 4)]

In [45]:
# %%sql

# select * from customer full join orders on customer.customer_id = orders.customer_id;

In [63]:
%%sql

SELECT * 
FROM customer 
WHERE customer_address LIKE '%sirukalanji%';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'Tharun', 'sirukalanji')]

In [ ]:
%%sql